results/rabbit/stage-10000/payload-heavy/100VUs/repeat-3/100vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rabbit/rabbitTest.js
        output: json (./results/rabbit/stage-10000/payload-heavy/100VUs/repeat-3/100vus.json)

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 400 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m01.0s/1m0s

running (0m02.0s), 100/100 VUs, 891 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m02.0s/1m0s

running (0m03.0s), 100/100 VUs, 1366 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m03.0s/1m0s

running (0m04.0s), 100/100 VUs, 1831 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m04.0s/1m0s

running (0m05.0s), 100/100 VUs, 2306 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m05.0s/1m0s

running (0m05.5s), 100/100 VUs, 2803 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m06.0s/1m0s

running (0m05.8s), 100/100 VUs, 3281 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m07.0s/1m0s

running (0m06.8s), 100/100 VUs, 3749 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m08.0s/1m0s

running (0m07.8s), 100/100 VUs, 4234 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m09.0s/1m0s

running (0m08.8s), 100/100 VUs, 4714 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m10.0s/1m0s

running (0m09.8s), 100/100 VUs, 5204 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m11.0s/1m0s

running (0m10.8s), 100/100 VUs, 5675 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m12.0s/1m0s

running (0m11.8s), 100/100 VUs, 6139 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m13.0s/1m0s

running (0m12.8s), 100/100 VUs, 6630 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m14.0s/1m0s

running (0m13.8s), 100/100 VUs, 7119 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m15.0s/1m0s

running (0m14.8s), 100/100 VUs, 7583 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m16.0s/1m0s

running (0m15.8s), 100/100 VUs, 8072 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m17.0s/1m0s

running (0m16.8s), 100/100 VUs, 8545 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m18.0s/1m0s

running (0m17.8s), 100/100 VUs, 9022 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m19.0s/1m0s

running (0m18.8s), 100/100 VUs, 9489 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m20.0s/1m0s

running (0m19.8s), 100/100 VUs, 9986 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m21.0s/1m0s

running (0m20.8s), 100/100 VUs, 10452 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m22.0s/1m0s

running (0m21.8s), 100/100 VUs, 10926 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m23.0s/1m0s

running (0m22.8s), 100/100 VUs, 11411 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m24.0s/1m0s

running (0m23.8s), 100/100 VUs, 11893 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m25.0s/1m0s

running (0m24.8s), 100/100 VUs, 12356 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m26.0s/1m0s

running (0m25.8s), 100/100 VUs, 12836 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m27.0s/1m0s

running (0m26.8s), 100/100 VUs, 13330 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m28.0s/1m0s

running (0m27.8s), 100/100 VUs, 13800 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m29.0s/1m0s

running (0m28.8s), 100/100 VUs, 14280 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  0m30.0s/1m0s

running (0m29.8s), 100/100 VUs, 14763 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  0m31.0s/1m0s

running (0m30.8s), 100/100 VUs, 15235 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  0m32.0s/1m0s

running (0m31.8s), 100/100 VUs, 15707 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  0m33.0s/1m0s

running (0m32.8s), 100/100 VUs, 16204 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  0m34.0s/1m0s

running (0m33.8s), 100/100 VUs, 16669 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  0m35.0s/1m0s

running (0m34.3s), 100/100 VUs, 17149 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  0m36.0s/1m0s

running (0m34.6s), 100/100 VUs, 17632 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  0m37.0s/1m0s

running (0m35.6s), 100/100 VUs, 18111 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  0m38.0s/1m0s

running (0m36.6s), 100/100 VUs, 18591 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  0m39.0s/1m0s

running (0m37.6s), 100/100 VUs, 19075 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  0m40.0s/1m0s

running (0m38.6s), 100/100 VUs, 19542 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  0m41.0s/1m0s

running (0m39.6s), 100/100 VUs, 20033 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  0m42.0s/1m0s

running (0m40.6s), 100/100 VUs, 20501 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  0m43.0s/1m0s

running (0m41.6s), 100/100 VUs, 20984 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  0m44.0s/1m0s

running (0m42.6s), 100/100 VUs, 21460 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  0m45.0s/1m0s

running (0m43.6s), 100/100 VUs, 21937 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  0m46.0s/1m0s

running (0m44.6s), 100/100 VUs, 22421 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  0m47.0s/1m0s

running (0m45.6s), 100/100 VUs, 22890 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  0m48.0s/1m0s

running (0m46.6s), 100/100 VUs, 23372 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  0m49.0s/1m0s

running (0m47.6s), 100/100 VUs, 23858 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  0m50.0s/1m0s

running (0m48.6s), 100/100 VUs, 24328 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  0m51.0s/1m0s

running (0m49.6s), 100/100 VUs, 24805 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  0m52.0s/1m0s

running (0m50.6s), 100/100 VUs, 25295 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  0m53.0s/1m0s

running (0m51.6s), 100/100 VUs, 25763 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  0m54.0s/1m0s

running (0m52.6s), 100/100 VUs, 26232 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  0m55.0s/1m0s

running (0m53.6s), 100/100 VUs, 26699 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  0m56.0s/1m0s

running (0m54.6s), 100/100 VUs, 27190 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  0m57.0s/1m0s

running (0m55.6s), 100/100 VUs, 27668 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  0m58.0s/1m0s

running (0m56.6s), 100/100 VUs, 28138 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  0m59.0s/1m0s

running (0m57.6s), 100/100 VUs, 28621 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 0.00%  0 out of 28738
    benchmark_total_failure_rate...: 0.00%  0 out of 28738

    HTTP
    http_req_duration..............: avg=205.87ms min=-291698884ns med=208.23ms max=254.25ms p(90)=212.12ms p(95)=214.82ms
      { expected_response:true }...: avg=205.87ms min=-291698884ns med=208.23ms max=254.25ms p(90)=212.12ms p(95)=214.82ms
    http_req_failed................: 0.00%  0 out of 28738
    http_reqs......................: 28738  496.643071/s

    EXECUTION
    iteration_duration.............: avg=209.21ms min=200.62ms     med=208.7ms  max=254.61ms p(90)=212.6ms  p(95)=215.31ms
    iterations.....................: 28738  496.643071/s
    vus............................: 100    min=100        max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 7.2 MB 124 kB/s
    data_sent......................: 947 MB 16 MB/s



running (0m57.9s), 000/100 VUs, 28738 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s